app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def find_post
    setup_enclosing_resources
    @post = Post.find(params[:id])

SELECT * FROM "posts"
---
  def find_posts
    setup_enclosing_resources
#    @posts = Post.find(:all)
    @posts = Post.paginate :page => params[:page], :per_page => 1,  :order => 'created_at ASC'

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-10-15 15:37:08', 'a post', 'nothing in the body of the post', '2009-10-15 15:37:08')
---
  def create
    respond_to do |format|
      if @post.save